var majorList=[
{
    "id" : "1",
    "className" : "管理科学与工程类",
    "class" : [
        {
            "name" : "管理科学"
        },
        {
            "name" : "信息管理和信息系统"
        },
        {
            "name" : "工业工程"
        },
        {
            "name" : "工程管理"
        },
        {
            "name" : "管理科学"
        },
        {
            "name" : "产品质量工程"
        }
    ]
},
{
    "id" : "2",
    "className" : "工商管理类",
    "class" : [
        {
            "name" : "工商管理"
        },
        {
            "name" : "市场营销"
        },
        {
            "name" : "商品学"
        },
        {
            "name" : "工程管理"
        },
        {
            "name" : "会计学"
        },
        {
            "name" : "审计学"
        },
        {
            "name" : "涉外会计"
        },
        {
            "name" : "会计信息系统"
        },
        {
            "name" : "财务管理"
        },
        {
            "name" : "财政金融"
        },
        {
            "name" : "资产评估"
        },
        {
            "name" : "企业管理"
        },
        {
            "name" : "商务策划管理"
        },
        {
            "name" : "国际商务"
        },
        {
            "name" : "电子商务"
        },
        {
            "name" : "房地产经营管理"
        },
        {
            "name" : "物业管理"
        },
        {
            "name" : "物流管理"
        },
        {
            "name" : "旅游管理"
        },
        {
            "name" : "酒店管理"
        },
        {
            "name" : "连锁经营管理"
        },
        {
            "name" : "人力资源管理"
        }
    ]
},
{
    "id" : "3",
    "className" : "公共管理类",
    "class" : [
        {
            "name" : "行政管理"
        },
        {
            "name" : "公共关系学"
        },
        {
            "name" : "文秘"
        },
        {
            "name" : "公共事业管理"
        },
        {
            "name" : "公共政策学"
        },
        {
            "name" : "国防教育与管理"
        },
        {
            "name" : "劳动关系"
        },
        {
            "name" : "劳动与社会保障"
        },
        {
            "name" : "城市规划与管理"
        },
        {
            "name" : "土地资源管理"
        },
        {
            "name" : "农业经济管理"
        },
        {
            "name" : "食品经济管理"
        },
        {
            "name" : "会展经济与管理"
        },
        {
            "name" : "文化产业管理"
        },
        {
            "name" : "体育产业管理"
        },
        {
            "name" : "房地产经营管理"
        },
        {
            "name" : "航运管理"
        }
    ]
},
{
    "id" : "4",
    "className" : "电子信息科学类",
    "class" : [
        {
            "name" : "电子信息科学与技术"
        },
        {
            "name" : "光信息科学与技术"
        },
        {
            "name" : "光电子技术科学"
        },
        {
            "name" : "微电子学"
        },
        {
            "name" : "信息科学技术"
        },
        {
            "name" : "信息安全"
        },
        {
            "name" : "科技防卫"
        }
    ]
},
{
    "id" : "5",
    "className" : "经济学类",
    "class" : [
        {
            "name" : "经济与金融"
        },
        {
            "name" : "经济学"
        },
        {
            "name" : "财政学"
        },
        {
            "name" : "金融学"
        },
        {
            "name" : "经济管理"
        },
        {
            "name" : "经济信息管理"
        },
        {
            "name" : "国际经济与贸易"
        },
        {
            "name" : "国际金融"
        },
        {
            "name" : "贸易经济"
        },
        {
            "name" : "金融工程"
        },
        {
            "name" : "投资学"
        },
        {
            "name" : "统计学"
        },
        {
            "name" : "保险"
        },
        {
            "name" : "税务"
        },
        {
            "name" : "信用管理"
        },
        {
            "name" : "网络经济学"
        },
        {
            "name" : "技术经济"
        }
    ]
},
{
    "id" : "6",
    "className" : "语言文学类",
    "class" : [
        {
            "name" : "汉语言文学"
        },
        {
            "name" : "对外汉语"
        },
        {
            "name" : "英语"
        },
        {
            "name" : "商务英语"
        },
        {
            "name" : "外贸英语"
        },
        {
            "name" : "俄语"
        },
        {
            "name" : "德语"
        },
        {
            "name" : "法语"
        },
        {
            "name" : "西班牙语"
        },
        {
            "name" : "阿拉伯语"
        },
        {
            "name" : "日语"
        },
        {
            "name" : "朝鲜语"
        },
        {
            "name" : "其它外语"
        }
    ]
},
{
    "id" : "7",
    "className" : "法学类",
    "class" : [
        {
            "name" : "法学"
        },
        {
            "name" : "马克思主义理论"
        },
        {
            "name" : "政治学与行政学"
        },
        {
            "name" : "思想政治教育"
        },
        {
            "name" : "国际政治"
        },
        {
            "name" : "国际经济法"
        },
        {
            "name" : "经济法"
        },
        {
            "name" : "社会学"
        },
        {
            "name" : "外交学"
        },
        {
            "name" : "公安学"
        }
    ]
},
{
    "id" : "8",
    "className" : "电气信息类",
    "class" : [
        {
            "name" : "电气工程及其自动化"
        },
        {
            "name" : "电气信息工程"
        },
        {
            "name" : "通信工程"
        },
        {
            "name" : "自动化"
        },
        {
            "name" : "电子信息工程"
        },
        {
            "name" : "电子科学与技术"
        },
        {
            "name" : "集成电路设计与集成系统"
        },
        {
            "name" : "影视艺术技术"
        },
        {
            "name" : "广播电视工程"
        }
    ]
},
{
    "id" : "9",
    "className" : "计算机科学与技术类",
    "class" : [
        {
            "name" : "计算机科学与技术"
        },
        {
            "name" : "计算机科学"
        },
        {
            "name" : "计算机工程"
        },
        {
            "name" : "计算机网络"
        },
        {
            "name" : "计算机应用"
        },
        {
            "name" : "软件工程"
        },
        {
            "name" : "计算机信息管理"
        }
    ]
},
{
    "id" : "10",
    "className" : "新闻传播学类",
    "class" : [
        {
            "name" : "新闻学"
        },
        {
            "name" : "广播电视新闻"
        },
        {
            "name" : "广告学"
        },
        {
            "name" : "编辑出版学"
        },
        {
            "name" : "传播学"
        },
        {
            "name" : "媒体创意"
        }
    ]
},
{
    "id" : "11",
    "className" : "心理学类",
    "class" : [
        {
            "name" : "心理学"
        },
        {
            "name" : "应用心理学"
        }
    ]
},
{
    "id" : "12",
    "className" : "数学类",
    "class" : [
        {
            "name" : "数学与应用数学"
        },
        {
            "name" : "信息与计算科学"
        }
    ]
},
{
    "id" : "13",
    "className" : "其他类",
    "class" : [
        {
            "name" : "其他专业"
        }
    ]
}
];
